{"aave": {"binance_symbol": "AAVEUSDT", "blockchain": "ethereum", "coingecko_id": "aave", "coingecko_name": "Aave", "consensus": "n/a", "sector": "lending", "tps": 20, "type": "erc-20", "usage": ["payments", "discount", "vote"], "desc": "Aave is an open-source and non-custodial protocol to earn interest on deposits and borrow assets with a variable or stable interest rate. It also enables ultra-short duration, uncollateralized flash loans designed to be integrated into other products and services."}, "ada": {"binance_symbol": "ADAUSDT", "blockchain": "cardano", "coingecko_id": "cardano", "coingecko_name": "Cardano", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 257, "type": "native", "usage": ["sustainability", "scalability", "dapps", "smart contracts", "payments", "vote", "regulatory control"], "desc": "Cardano is an open-source, smart-contract platform that aims to provide multiple features through layered design. Its modularization will eventually allow for network delegation, sidechains, and light client data structures. Cardano uses a version of Proof-of-Stake (PoS) called Ouroboros to secure the network and manage the block production process. The network features a native token called ADA that gives stakers a claim on new issuance in proportion to their holdings and allows users to pay for transactions."}, "algo": {"binance_symbol": "ALGOUSDT", "coingecko_id": "algorand", "coingecko_name": "Algorand", "blockchain": "algorand", "consensus": ["proof of stake", "pure proof of stake"], "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["scalability", "payments", "smart contracts", "dapps", "governance"], "desc": "Algorand is a scalable, secure, and decentralized digital currency and smart contract platform. Its protocol uses a variation of Proof-of-Stake (PoS) called Pure PoS (PPoS) to secure the network and reach consensus on block production. Unlike other PoS models, PPoS does not reward, nor does it put validator or user funds at risk of being slashed (a loss of funds used to promote honest node and user behavior). Algorand intends to eventually leverage its PPoS design to form the foundation for an on-chain governance system."}, "amp": {"blockchain": "ethereum", "coingecko_id": "amp-token", "coingecko_name": "Amp", "consensus": "proof of work", "sector": "payment platforms", "tps": 20, "type": "erc-20", "usage": ["payments", "collateralization"], "desc": "Amp is a digital collateral token that offers instant, verifiable collateralization for any kind of value transfer. Projects like Flexa use Amp to secure transactions and build networks that accrue value both securely and transparently."}, "ar": {"binance_symbol": "ARUSDT", "coingecko_id": "arweave", "coingecko_name": "Arweave", "blockchain": "arweave", "consensus": "proof of access", "sector": "file storage", "tps": "n/a", "type": "native", "usage": ["storage", "payments"], "desc": "Could not do ar"}, "atom": {"binance_symbol": "ATOMUSDT", "blockchain": ["cosmos network", "gaia"], "coingecko_id": "cosmos", "coingecko_name": "Cosmos", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 7000, "type": "native", "usage": ["payments", "vote", "multi-chain support", "defi", "smart contracts", "dapps", "fees payment", "scalability", "speed", "gaming"], "desc": "Cosmos is a network of sovereign blockchains that communicate via IBC, an interoperability protocol modeled after TCP/IP, for secure data and value transfer. The Cosmos Hub, also known as \"Gaia,\" is a proof of stake chain with a native token, ATOM, that acts as the primary hub for IBC packet routing among blockchains within the Cosmos network. The Cosmos Hub, like the majority of blockchains in the Cosmos network, is secured by the Byzantine Fault-Tolerant (BFT) Proof-of-Stake consensus algorithm, Tendermint."}, "avax": {"binance_symbol": "AVAXUSDT", "blockchain": ["avalanche", "x-chain", "p-chain", "c-chain"], "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 4500, "type": "native", "usage": ["vote", "dapps", "smart contracts", "speed", "sustainability", "fees payment", "defi", "nft", "gaming"], "coingecko_id": "binance-peg-avalanche", "coingecko_name": "Binance-Peg Avalanche", "desc": "Avalanche is an open-source platform for launching decentralized finance applications and enterprise blockchain deployments in one interoperable, scalable ecosystem. Developers who build on Avalanche can create applications and custom blockchain networks with complex rulesets or build on existing private or public subnets."}, "axs": {"binance_symbol": "AXSUSDT", "coingecko_id": "axie-infinity", "coingecko_name": "Axie Infinity", "blockchain": "ethereum", "consensus": "proof of authority", "sector": "gaming", "tps": "n/a", "type": "erc-20", "usage": ["work", "vote", "payments", "gaming"], "desc": "Architected by Sky Mavis and inspired by Pokemon, Axie Infinity is a \"play-to-earn\" pet training game and virtual world built on the Ethereum blockchain. Players can collect, breed, battle, and trade in-game pets called Axies. All in-game assets are represented via fungible ERC-20 or non-fungible ERC-721 tokens and thus trade on secondary markets."}, "bch": {"binance_symbol": "BCHUSDT", "blockchain": "bitcoin cash", "coingecko_id": "bitcoin-cash", "coingecko_name": "Bitcoin Cash", "consensus": "proof of work", "sector": "currencies", "tps": 116, "type": "native", "usage": ["payments"], "desc": "Bitcoin Cash is a Bitcoin hard fork advocating for and building towards a literal interpretation of Bitcoin as a \"peer-to-peer electronic cash system\". It views cheap peer to peer transactions as the core value proposition of the network and is dedicated to increasing block sizes and on-chain transaction throughput in pursuit of this goal. Bitcoin Cash believes that starting as a medium of exchange is the superior route to becoming money in opposition to Bitcoin's strategy of first optimizing for securely storing value."}, "bnb": {"binance_symbol": "BNBUSDT", "blockchain": "binance chain", "coingecko_id": "binancecoin", "coingecko_name": "Binance Coin", "consensus": "proof of stake", "sector": "centrilized exchanges", "tps": 94, "type": "native", "usage": ["fees payment", "access", "discount", "vote", "exchange token"], "desc": "Binance Coin is digital asset native to the Binance blockchain and launched by the Binance online exchange."}, "bsv": {"blockchain": "bitcoin sv", "coingecko_id": "bitcoin-cash-sv", "coingecko_name": "Bitcoin SV", "consensus": "proof of work", "sector": "currencies", "tps": 9000, "type": "native", "usage": ["payments"], "desc": "Bitcoin SV is a Bitcoin Cash hard fork prioritizing what the creators consider strict adherence to Satoshi Nakamo's original Bitcoin client. It views cheap peer-to-peer transactions as the core value proposition of the network and is dedicated to increasing block sizes and on-chain transaction throughput in pursuit of this goal."}, "btc": {"binance_symbol": "BTCUSDT", "blockchain": "bitcoin", "coingecko_id": "bitcoin", "coingecko_name": "Bitcoin", "consensus": "proof of work", "sector": "currencies", "tps": 7, "type": "native", "usage": "payments", "desc": "Bitcoin is the first distributed consensus-based, censorship-resistant, permissionless, peer-to-peer payment settlement network with a provably scarce, programmable, native currency. Bitcoin (BTC), the native asset of the Bitcoin blockchain, is the world's first digital currency without a central bank or administrator. The Bitcoin network is an emergent decentralized monetary institution that exists through the interplay between full nodes, miners, and developers. It is set by a social contract that is created and opted into by the users of the network and hardened through game theory and cryptography. Bitcoin is the first, oldest, and largest cryptocurrency in the world."}, "btg": {"binance_symbol": "BTGUSDT", "coingecko_id": "bitcoin-gold", "coingecko_name": "Bitcoin Gold", "blockchain": "bitcoin gold", "consensus": "proof of work", "sector": "payments", "tps": "n/a", "type": "native", "usage": ["governance", "payments"], "desc": "Bitcoin Gold is an experimental Bitcoin hard fork that prioritizes \"one CPU one vote\" blockchain governance."}, "btt": {"binance_symbol": "BTTUSDT", "coingecko_id": "bittorrent-2", "coingecko_name": "BitTorrent", "blockchain": "tron", "consensus": "n/a", "sector": "file storage", "tps": "n/a", "type": "trc-10", "usage": ["payments"], "desc": "Could not do btt"}, "busd": {"binance_symbol": "BUSDUSDT", "blockchain": "ethereum", "coingecko_id": "binance-usd", "coingecko_name": "Binance USD", "consensus": "n/a", "sector": "stablecoins", "tps": 20, "type": "erc-20", "usage": "payments", "desc": "Binance USD (BUSD) is a fiat-collateralized stablecoin that offers the advantages of transacting with blockchain-based assets while mitigating price risk. BUSD are issued as ERC-20 tokens on the Ethereum blockchain and are collateralized 1:1 by USD held in Paxos-owned US bank accounts. BUSD is also the one of three stablecoins approved by Wall Street regulators, alongside GUSD and PAX."}, "cake": {"binance_symbol": "CAKEUSDT", "coingecko_id": "pancakeswap-token", "coingecko_name": "PancakeSwap", "blockchain": "binance smart chain", "consensus": "n/a", "sector": "decentralized exchanges", "tps": "n/a", "type": "bep-20", "usage": ["vote", "dividends", "defi", "lotteries", "initial farm offerings"], "desc": "PancakeSwap is a decentralized exchange (DEX) built on Binance Smart Chain (BSC) that utilizes an automated market making (AMM) system. PancakeSwap is a fork of SushiSwap and has an almost identical codebase, but it has the advantage of cheaper and faster transactions from being built on BSC. It also offers additional features compared to SushiSwap, such as yield farming across other protocols, lotteries, and initial farm offerings (IFO)."}, "cdai": {"blockchain": "ethereum", "coingecko_id": "cdai", "coingecko_name": "cDAI", "consensus": "n/a", "sector": "ctokens", "tps": 20, "type": "erc-20", "usage": ["payments", "money market"], "desc": "Could not do cdai"}, "cel": {"coingecko_id": "celsius-degree-token", "coingecko_name": "Celsius Network", "blockchain": "ethereum", "consensus": "n/a", "sector": "lending", "tps": "n/a", "type": "erc-20", "usage": ["payments", "access", "cefi"], "desc": "The Celsius Network is a leading retail savings platform for interest-bearing and borrowing accounts with fiat on-ramp, as well as a market-leading CeFi lending provider. Celsius Network operates on a community-first mandate, giving 80% of its revenue back to its users in the form of additional earnings on saving and borrowing. Combining attractive interest rates, low fees, and a strong community, the platform has experienced considerable growth since inception."}, "celo": {"binance_symbol": "CELOUSDT", "coingecko_id": "celo", "coingecko_name": "Celo", "blockchain": "celo", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "governance", "dapps"], "desc": "Celo is a blockchain protocol that aims to address some of the barriers to cryptoasset adoption (user experience and volatility) by using phone numbers as public keys and issuing a native stable-value token. The network supports the development of smart contracts and decentralized applications. Its first application, Celo Wallet, intends to be a social-payments system centered around mobile phones. Celo features two primary cryptoassets: Celo and Celo Dollars. Celo (CELO) is the protocol's native asset. It serves as a utility that enables users to participate in network consensus (through its Proof-of-Stake system) pay for on-chain transactions, and vote on governance decisions. Celo Dollars (cUSD) are a stable asset that follows the US Dollar."}, "ceth": {"blockchain": "ethereum", "coingecko_id": "compound-ether", "coingecko_name": "cETH", "consensus": "n/a", "sector": "lending", "tps": "n/a", "usage": "defi", "desc": "Could not do ceth"}, "chz": {"binance_symbol": "CHZUSDT", "blockchain": "chiliz", "coingecko_id": "chiliz", "coingecko_name": "Chiliz", "consensus": "n/a", "sector": "sports", "tps": "n/a", "type": ["bep2", "erc-20"], "usage": "payments", "desc": "Chiliz developed the Socios.com sports fan engagement platform which is built on the Chiliz blockchain infrastructure & uses $CHZ as it’s exclusive on-platform currency."}, "comp": {"binance_symbol": "COMPUSDT", "coingecko_id": "compound-governance-token", "coingecko_name": "Compound", "blockchain": "ethereum", "consensus": "n/a", "sector": "lending", "tps": "n/a", "type": "erc-20", "usage": "defi", "desc": "Compound is a lending platform built on Ethereum that enables users to permissionlessly borrow or lend from a pool of assets. Rather than interest rates being set by individuals, they are determined algorithmically based on the proportion of assets lent out."}, "cro": {"blockchain": "crypto.org chain", "coingecko_id": "crypto-com-chain", "coingecko_name": "Crypto.com Coin", "consensus": "n/a", "sector": "payment platforms", "tps": 300, "type": "erc-20", "usage": ["payments", "defi"], "desc": "Could not do cro"}, "curve": {"blockchain": "ethereum", "consensus": "proof of stake", "sector": "decentralized exchanges", "tps": "n/a", "type": "erc-20", "usage": ["vote", "defi"], "coingecko_id": "curvehash", "coingecko_name": "CURVEHASH", "desc": "Curve Finance is a decentralized exchange optimized for low slippage swaps between stablecoins or similar assets that peg to the same value (e.g. wBTC/renBTC). The protocol employs a Automated Market Maker that was built specifically to give DeFi users low slippage and liquidity providers steady fee revenue."}, "cusdc": {"blockchain": "ethereum", "coingecko_id": "compound-usd-coin", "coingecko_name": "cUSDC", "consensus": "n/a", "sector": "ctokens", "tps": 20, "type": "erc-20", "usage": ["payments", "money market"], "desc": "Could not do cusdc"}, "dai": {"binance_symbol": "DAIUSDT", "blockchain": "ethereum", "coingecko_id": "dai", "coingecko_name": "Dai", "consensus": "n/a", "sector": "stablecoins", "tps": 20, "type": "erc-20", "usage": ["payments"], "desc": "Dai a fully collateralized stablecoin native to Maker's decentralized autonomous organization (DAO)."}, "dash": {"binance_symbol": "DASHUSDT", "coingecko_id": "dash", "coingecko_name": "Dash", "blockchain": "dash", "consensus": ["proof of work", "nakamoto consensus", "proof of service"], "sector": "currencies", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "scalability", "speed"], "desc": "Dash is a fork of Bitcoin that focuses on the payments use case. It has introduced a number of features to the industry including masternodes, LLMQs, ChainLocks, and InstantSend, which target scalability, speed, reliability, cost-effectiveness, and user experience. The Dash network is also the longest-running decentralized autonomous organization, utilizing on-chain governance to allocate network resources toward projects and organizations that support the network."}, "dcr": {"binance_symbol": "DCRUSDT", "coingecko_id": "decred", "coingecko_name": "Decred", "blockchain": "decred", "consensus": ["proof of work", "proof of stake"], "sector": "currencies", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "sustainability"], "desc": "Decred is a hybrid proof-of-work proof-of-stake (PoW/PoS) cryptocurrency with a strong focus on community input, open governance, and sustainable funding for development. It utilizes its hybrid consensus and on-chain governance systems to ensure that a small group cannot dominate the flow of transactions or make changes to Decred without the input of the community. The project funds its own development from a decentralized treasury."}, "doge": {"binance_symbol": "DOGEUSDT", "coingecko_id": "dogecoin", "coingecko_name": "Dogecoin", "blockchain": "doge", "consensus": "proof of work", "sector": "currencies", "tps": "n/a", "type": "native", "usage": "payments", "desc": "Dogecoin is a playful cryptocurrency popularized by adopting the Shiba Inu internet meme."}, "dot": {"binance_symbol": "DOTUSDT", "coingecko_id": "polkadot", "coingecko_name": "Polkadot", "blockchain": "polkadot", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "security", "dapps"], "desc": "Polkadot is a blockchain network designed to support various interconnected, application-specific sub-chains called parachains (short for parallelized chains). Each chain built within Polkadot uses Parity Technologies' Substrate modular framework, which allows developers to select specific components that suit their application-specific chain best. Polkadot refers to the entire ecosystem of parachains that plug into a single base platform known as the Relay Chain. This base platform, which also leverages Substrate, does not support application functionality but instead provides security to the network's parachains and contains Polkadot's consensus, finality, and voting logic."}, "dydx": {"binance_symbol": "DYDXUSDT", "blockchain": "ethereum", "coingecko_id": "dydx", "coingecko_name": "dYdX", "consensus": "proof of stake", "sector": "decentralized exchanges", "tps": "n/a", "type": "erc-20", "usage": ["defi", "vote", "discount"], "desc": "dYdX is a decentralized exchange that offers complex financial instruments to its users such as perpetuals, margin and spot trading, as well as lending and borrowing. It uses off-chain order books with on-chain settlement and enables traders to short-sell tokens, increase exposure by longing with leverage, or earn interest on their deposited tokens."}, "egld": {"binance_symbol": "EGLDUSDT", "coingecko_id": "elrond-erd-2", "coingecko_name": "Elrond", "blockchain": "elrond", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "speed", "dapps"], "desc": "Elrond is a blockchain designed for high throughput and relatively fast execution speed compared to other smart contract platforms. It features Adaptive State Sharding as its scaling solution and a Proof-of-Stake (PoS) variation called Secure PoS to secure the network. Elrond also contains a WebAssembly-based virtual machine that can support the creation and execution of decentralized applications (dApps)."}, "enj": {"binance_symbol": "ENJUSDT", "coingecko_id": "enjincoin", "coingecko_name": "Enjin Coin", "blockchain": "ethereum", "consensus": "n/a", "sector": "gaming", "tps": "n/a", "type": "erc-20", "usage": ["access", "gaming", "marketplace"], "desc": "Enjin is a Singapore-based technology company that provides services for building gaming communities as well as services for blockchain game developers. Enjin provides a suite of tools based on a web interface that supports Ethereum digital assets in the form of ERC-1155 tokens. Enjin also operates a virtual goods marketplaces for digital assets on Ethereum."}, "eos": {"binance_symbol": "EOSUSDT", "blockchain": "eosio", "coingecko_id": "eos", "coingecko_name": "EOS", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 9600, "type": "native", "usage": ["payments", "vote", "dapps", "smart contracts"], "desc": "EOS is an open-source protocol designed by Dan Larimer and Block.one to support the creation of smart contracts and decentralized applications (dApps). Its network features a delegated Proof-of-Stake (DPoS) consensus mechanism to help secure the platform while giving it a level of performance desirable for running applications. Through DPoS, EOS offers greater scalability and transaction throughput than traditional blockchain networks, but to a certain extent, it relinquishes complete decentralization and censorship resistance."}, "etc": {"binance_symbol": "ETCUSDT", "coingecko_id": "ethereum-classic", "coingecko_name": "Ethereum Classic", "blockchain": "ethereum classic", "consensus": "proof of work", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["dapps", "smart contracts", "payments", "vote"], "desc": "Ethereum Classic is a decentralized computing platform designed to execute smart contracts, which are applications that run as programmed without the possibility of censorship or third-party interference. It is a distributed network consisting of a blockchain ledger, a native cryptocurrency (called ETC), and an ecosystem of on-chain applications and services. Ethereum Classic is the legacy chain that split from Ethereum following a contentious hard fork, known as The DAO fork, in Jul. 2017. Like its sister chain, Ethereum Classic features an execution engine optimized for smart contract processing (known as the Ethereum Virtual Machine or EVM) and a Proof of Work (PoW) consensus system. While it shares some aspects with Ethereum, Ethereum Classic offers a more defined monetary policy and inflation schedule."}, "eth": {"binance_symbol": "ETHUSDT", "coingecko_id": "ethereum", "coingecko_name": "Ethereum", "blockchain": "ethereum", "consensus": "proof of work", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["dapps", "smart contracts", "payments", "vote", "defi"], "desc": "Ethereum is a distributed blockchain computing platform for smart contracts and decentralized applications. Its native token is ether (ETH), which primarily serves as a means of payment for transaction fees and as collateral for borrowing specific ERC-20 tokens within the decentralized finance (DeFi) sector."}, "fil": {"binance_symbol": "FILUSDT", "blockchain": "filecoin", "coingecko_id": "filecoin", "coingecko_name": "Filecoin", "consensus": ["proof of spacetime", "proof of replication"], "sector": "file storage", "tps": 15, "type": "native", "usage": ["payments"], "desc": "Filecoin is a decentralized data storage network built by Protocol Labs that allows users to sell their excess storage on an open platform. It acts as the incentive and security layer for IPFS (InterPlanetary File System), a peer-to-peer network for storing and sharing data files. Filecoin turns IPFS' storage system into an \"algorithmic market,\" where users pay storage providers in Filcoin's native token, FIL, to store and distribute data on the network."}, "flow": {"binance_symbol": "FLOWUSDT", "coingecko_id": "flow", "coingecko_name": "Flow", "blockchain": "flow", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["dapps", "smart contracts", "payments", "vote", "scalability"], "desc": "Flow is a blockchain created by Dapper Labs that aims to make it easy for developers to build decentralized applications and businesses. Flow uses a multi-role architecture design to scale the network instead of sharding. One of the fundamental reasons Dapper Labs opted to shift away from Ethereum and build its own general-purpose blockchain was to avoid the complexity of sharding. Flow asserts that its scaling-without-sharding strategy will improve network speed and throughput while preserving composability standards and a developer-friendly, ACID-compliant environment."}, "ftm": {"binance_symbol": "FTMUSDT", "blockchain": "fantom", "coingecko_id": "fantom", "coingecko_name": "Fantom", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 7500, "type": ["bep2", "erc-20", "native"], "usage": ["payments", "vote", "dapps", "scalability", "speed"], "desc": "Fantom is a Layer-1 blockchain that uses a single consensus layer to support the creation of multiple execution chains. The network's independent consensus layer called Lachesis, featuring a novel consensus mechanism developed by the Fantom Foundation dubbed the \"Lachesis Protocol.\" Lachesis can provide security to multiple other layers, the first of which is Fantom's EVM-compatible smart contract chain called Opera. The project's goal is to host an ecosystem of execution layers while enabling them to feature fast and cost-efficient transactions due to the benefits provided by the Lachesis Protocol."}, "ftt": {"binance_symbol": "FTTUSDT", "blockchain": "ethereum", "coingecko_id": "ftx-token", "coingecko_name": "FTX Token", "consensus": "n/a", "sector": "centrilized exchanges", "tps": 20, "type": "erc-20", "usage": ["discount", "exchange token"], "desc": "FTT is the native token designed for the cryptocurrency derivatives exchange FTX. It has numerous uses designed to benefit its users and increase network effects around the platform."}, "grt": {"binance_symbol": "GRTUSDT", "coingecko_id": "the-graph", "coingecko_name": "The Graph", "blockchain": "ethereum", "consensus": "proof of stake", "sector": "data management", "tps": "n/a", "type": "erc-20", "usage": ["work", "payments", "vote"], "desc": "The Graph is a protocol for indexing and querying data from blockchains, starting with Ethereum. Developers build applications with open APIs called subgraphs to easily access on-chain data that is indexed by a network of node operators."}, "hbar": {"binance_symbol": "HBARUSDT", "coingecko_id": "hedera-hashgraph", "coingecko_name": "Hedera", "blockchain": "hedera", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["scalability", "smart contracts", "payments", "speed"], "desc": "Hedera Hashgraph is a distributed ledger of transactions, otherwise known as a DLT (distributed ledger technology). While blockchains are the most commonly used DLTs, Hedera is slightly different since it uses a new consensus algorithm known as hashgraph. The hashgraph consensus algorithm aims to process and finalize more transactions at scale than traditional Proof-of-Work (PoW) networks, as they are often characterized by high latency and low transactions per second (tps). Hedera's state is stored on mainnet nodes, which are all currently run by members of the Hedera Governing Council. But in the future, mainnet nodes will be permissionless. These nodes secure the Hedera ledger by reaching a consensus on the validity and order of transactions."}, "hnt": {"binance_symbol": "HNTUSDT", "coingecko_id": "helium", "coingecko_name": "Helium", "blockchain": "helium", "consensus": "proof of coverage", "sector": "iot", "tps": "n/a", "type": "native", "usage": ["work", "payments"], "desc": "Helium is a decentralized, open wireless network built on a new blockchain for the physical world. It relies on a novel type of work called Proof of Coverage, and a new consensus algorithm (based on HoneyBadger BFT). The Helium Network is used to route data for long-range, lower power IoT devices that use Helium's LongFi protocol"}, "hot": {"binance_symbol": "HOTUSDT", "blockchain": "holochain", "coingecko_id": "holotoken", "coingecko_name": "Holo", "consensus": "distributed hash table", "sector": "application development", "tps": "n/a", "type": "erc-20", "usage": "access", "desc": "Holochain is a distributed hash table engineered for data integrity and to support Holo, a distributed computing application."}, "ht": {"blockchain": "ethereum", "coingecko_id": "huobi-token", "coingecko_name": "Huobi Token", "consensus": "n/a", "sector": "centrilized exchanges", "tps": 20, "type": "erc-20", "usage": "discount", "desc": "Huobi Token is an ecosystem token launched by Huobi Global, offering benefits such as trading fee and margin discounts and access to certain trading events. Huobi has committed to using 20% of exchange revenues every quarter to buy HT in the open market and subsequently burn. They also burn tokens used in FastTrack to vote on token listings as well as for ticket sales from Huobi Prime Initial Exchange Offerings (IEO)"}, "icp": {"binance_symbol": "ICPUSDT", "blockchain": "internet computer", "coingecko_id": "internet-computer", "coingecko_name": "Internet Computer", "consensus": "threshold relay", "sector": "smart contract platforms", "tps": 9000, "type": "native", "usage": ["payments", "work", "scalability", "speed"], "desc": "The Internet Computer (IC) is a blockchain network built by the DFINITY Foundation that aims to support smart contract development at scale. It's an attempt to reinvent how users interact with internet applications as its nodes run on specialized hardware housed by various independent data centers. The IC lets developers deploy and run applications through the use of canisters, which are akin to smart contracts. Each canister has a storage capacity of 4GB. The IC features two core tokens: ICP is the network's governance token, and Cycles (created by burning ICP) are a form of stablecoin that allows users to pay for computational resources and network transactions."}, "icx": {"binance_symbol": "ICXUSDT", "coingecko_id": "icon", "coingecko_name": "ICON", "blockchain": "icon", "consensus": "threshold relay", "sector": "enterprise and baas", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "intermediary"], "desc": "The ICON Project aims to build a decentralized network that allows independent blockchains with different governances to transact with one another without intermediaries."}, "iost": {"binance_symbol": "IOSTUSDT", "coingecko_id": "iostoken", "coingecko_name": "IOST", "blockchain": "ios", "consensus": "n/a", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "scalability"], "desc": "IOSToken (IOST) is building a proprietary blockchain, called Internet of Services (IOS), focused on scalable and high throughput smart contract processing."}, "miota": {"blockchain": "tangle", "consensus": "dag", "sector": "iot", "tps": 1500, "type": "native", "usage": ["payments", "security", "sustainability", "regulatory control", "scalability"], "coingecko_id": "iota", "coingecko_name": "IOTA", "desc": "IOTA is transaction settlement and data transfer layer for the Internet of Things (IoT). It's distributed ledger, the Tangle, is based on a data structure referred to as a Directed Acyclic Graph (DAG). In the Tangle there are no blocks or miners, and every transaction on the Iota network must validate two previous transactions through a small proof-of-work (PoW). Thus the more transactions occur, the faster the network can process new transactions, theoretically allowing the network to become more efficient as it scales."}, "klay": {"binance_symbol": "KLAYUSDT", "blockchain": "klaytn", "coingecko_id": "klay-token", "coingecko_name": "Klaytn", "consensus": "ibft", "sector": "smart contract platforms", "tps": 4000, "type": "native", "usage": ["payments", "smart contracts", "dapps"], "desc": "Could not do klay"}, "ksm": {"binance_symbol": "KSMUSDT", "coingecko_id": "kusama", "coingecko_name": "Kusama", "blockchain": "kusama", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "polkadot sandbox"], "desc": "Kusama is an early, experimental version of Polkadot that exists as an independent network. It intends to act as a sandbox for developers, allowing teams to deploy and test pre-release versions of their projects before launching them on Polkadot's mainnet. Kusama will also serve as a testbed for Parity Technologies leading up to the mainnet launch of Polkadot. Like its sister chain, Kusama uses a native token, KSM, to power computation and give holders the ability to participate in securing the network and voting on upgrade proposals."}, "leo": {"blockchain": ["ethereum", "eos"], "coingecko_id": "leo-token", "coingecko_name": "LEO Token", "consensus": "n/a", "sector": "centrilized exchanges", "tps": 20, "type": ["erc-20", "eosio"], "usage": "discount", "desc": "A utility token for the iFinex ecosystem"}, "link": {"binance_symbol": "LINKUSDT", "coingecko_id": "chainlink", "coingecko_name": "Chainlink", "blockchain": "ethereum", "consensus": "chainlink smart contract", "sector": "data management", "tps": "n/a", "type": "erfc-20", "usage": ["work", "payments"], "desc": "Chainlink is a decentralized oracle network. It aims to serve as a middleware between smart contracts on smart contracting platforms and external data sources, allowing smart contracts to securely access off-chain data feeds."}, "ltc": {"binance_symbol": "LTCUSDT", "blockchain": "litecoin", "coingecko_id": "litecoin", "coingecko_name": "Litecoin", "consensus": "proof of work", "sector": "currencies", "tps": 28, "type": "native", "usage": ["payments"], "desc": "Litecoin is a fork of Bitcoin's codebase with four times faster block times and a four times larger supply. The project considers itself complementary to Bitcoin as a silver to Bitcoin's gold. It is often used as a pseduo-testnet for Bitcoin, adopting new protocol changes before they are deployed on Bitcoin."}, "luna": {"binance_symbol": "LUNAUSDT", "blockchain": "terra", "coingecko_id": "terra-luna", "coingecko_name": "Terra", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 10000, "type": "native", "usage": ["payments", "vote", "smart contracts"], "desc": "Terra is an algorithmically-governed, seigniorage share style stablecoin platform to which a collection of fiat-pegged tokens and a stabilizing cryptoasset, Luna, are native."}, "matic": {"binance_symbol": "MATICUSDT", "blockchain": ["polygon network", "ethereum", "side-chains"], "coingecko_id": "matic-network", "coingecko_name": "Polygon", "consensus": "proof of stake", "sector": "scaling", "tps": 7200, "type": "native", "usage": ["payments", "vote", "dapps", "scalability", "multi-chain support", "defi", "smart contracts", "fees payment", "nft", "gaming", "speed"], "desc": "Polygon is a platform design to support infrastructure development and help Ethereum scale. Its core component is a modular, flexible framework (Polygon SDK) that allows developers to build and connect Layer-2 infrastructures like Plasma, Optimistic Rollups, zkRollups, and Validium and standalone sidechains like the project's flagship product, Matic POS (Proof-of-Stake). Polygon rebranded from Matic Network in February 2021 and pivoted towards supporting multiple Layer-2 infrastructure. It will continue to support the Matic POS sidechain and Plasma-based payment system, which currently hosts over 90 applications."}, "mim": {"blockchain": "ethereum", "coingecko_id": "magic-internet-money", "coingecko_name": "Magic Internet Money", "consensus": "proof of stake", "sector": "lending", "tps": "n/a", "type": "erc-20", "usage": "defi", "desc": "Could not do mim"}, "mkr": {"binance_symbol": "MKRUSDT", "blockchain": "ethereum", "coingecko_id": "maker", "coingecko_name": "Maker", "consensus": "proof of work", "sector": "lending", "tps": 20, "type": "erc-20", "usage": "vote", "desc": "Maker is a peer-to-contract lending platform enabling over-collateralized loans by locking Ether in a smart contract and minting Dai, a stablecoin pegged to the US dollar. Dai's stability is achieved through a dynamic system of collateralized debt positions, autonomous feedback mechanisms and incentives for external actors. Once generated, Dai can be freely sent to others, used as payments for goods and services, or held as long term savings."}, "near": {"binance_symbol": "NEARUSDT", "coingecko_id": "near", "coingecko_name": "Near", "blockchain": "near", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "work", "scalability"], "desc": "NEAR is a decentralized development platform that uses a Proof-of-Stake (PoS) consensus mechanism and will eventually feature a sharded architecture to scale transaction throughput. Its block generation scheme is called Doomslug and its proposed sharding design is dubbed Nightshade. These technologies will work together to scale the network and minimize congestion. NEAR has also been designed to be developer and user-friendly as it features a few key innovations to accelerate the application development and user-onboarding processes. The NEAR blockchain was created and developed by the NEAR Foundation. Its mainnet went live in April 2020, and network validators voted to unlock token transfers in October 2020. NEAR's bridge to Ethereum (called the Rainbow Bridge) launched in March 2021."}, "neo": {"binance_symbol": "NEOUSDT", "blockchain": "neo", "coingecko_id": "neo", "coingecko_name": "NEO", "consensus": "dbft", "sector": "smart contract platforms", "tps": 5000, "type": "native", "usage": ["payments", "vote", "smart contracts", "digital assets", "digital identity"], "desc": "NEO aims to build a comprehensive \"smart economy\" by incorporating digital assets, digital identities, and smart contracts."}, "ohm": {"blockchain": "ethereum", "coingecko_id": "olympus", "coingecko_name": "Olympus", "consensus": "n/a", "sector": "currencies", "tps": 20, "type": "erc-20", "usage": ["payments", "vote"], "desc": "Olympus is a \"non pegged stablecoin\" that attempts to be less volatile than traditional cryptocurrencies while not being pegged to any fiat currencies. Instead, the value of its OHM token is meant to float based on the value of its underlying treasury of assets and parameters set by the DAO. It achieves this through minting OHM when it is greater than its intrinsic value and burning OHM when it is less. The end goal of the project is to become a crypto-native currency that is used as an alternative to the USD or other fiat currencies."}, "okb": {"coingecko_id": "okb", "coingecko_name": "OKB", "sector": "centrilized exchanges", "tps": "n/a", "type": "erc-20", "usage": ["payments", "discount", "vote"], "desc": "OKB is the native exchange token of OKEx that provides discounts on trading fees, access to the OK Jumpstart initial exchange offering (IEO) platform, and voting rights for tokens to be listed on the exchange. In the future, it will be used to pay transaction fees on the OKChain blockchain as well as decentralized exchange OKDEX."}, "omg": {"binance_symbol": "OMGUSDT", "blockchain": "ethereum", "coingecko_id": "omisego", "coingecko_name": "OMG Network", "consensus": "proof of authority", "sector": "scaling", "tps": 800, "type": "erc-20", "usage": "payments", "desc": "OMG Network is a Layer-2 scaling protocol for Ethereum. What this protocol aims to achieve is a higher transaction throughput at a lower cost while leveraging the security guarantees of its underlying layer. OMG Network is predicated on the creation of a child chain that batches transactions before committing them to the root chain, which, in this case, is Ethereum. The child chain relies on the root chain as the trust and arbitration layer. With this type of relationship, if something goes wrong with the child chain, users’ funds should remain safe. The protocol's token, OMG, is the primary method by which users can pay for transaction fees and interact with the network."}, "omi": {"coingecko_id": "ecomi", "coingecko_name": "ECOMI", "sector": "gaming", "blockchain": "GoChain", "consensus": "n/a", "usage": ["digital assets", "nft"], "desc": "Could not do omi"}, "one": {"binance_symbol": "ONEUSDT", "blockchain": "harmony", "coingecko_id": "harmony", "coingecko_name": "Harmony", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 2000, "type": "native", "usage": ["payments", "dapps", "nft"], "desc": "Could not do one"}, "qnt": {"binance_symbol": "QNTUSDT", "coingecko_id": "quant-network", "coingecko_name": "Quant", "blockchain": "ethereum", "consensus": "n/a", "sector": "interoperability", "tps": "n/a", "type": "erc-20", "usage": "access", "desc": "Could not do qnt"}, "qtum": {"binance_symbol": "QTUMUSDT", "blockchain": "qtum", "coingecko_id": "qtum", "coingecko_name": "Qtum", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 70, "type": "native", "usage": ["payments", "smart contracts", "vote", "dapps", "fees payment"], "desc": "Qtum (pronounced Quantum) is a smart contract platform that uses a Proof-of-Stake (PoS) consensus mechanism to validate transaction blocks and provide security assurances. It combines different aspects of the Ethereum and Bitcoin blockchains. Qtum uses Bitcoin core as the base of its network for security and stability reasons and, therefore, operates via a UTXO model. The project also integrated Ethereum's virtual machine (the EVM) so the chain could run Turing complete code needed to support smart contracts, and thus decentralized applications (dApps). Qtum's stack features a middleware layer, dubbed the account abstraction layer (AAL), to ensure the UTXO set was compatible with the smart contract execution layer. Qtum's native token (QTUM) allows users to pay transaction fees, participate in network security, and vote on protocol upgrade proposals."}, "renbtc": {"binance_symbol": "RENBTCBTC", "coingecko_id": "renbtc", "coingecko_name": "renBTC", "blockchain": "ethereum", "sector": "stablecoins", "type": "erc-20", "usage": "payments", "desc": "Could not do renbtc"}, "rune": {"binance_symbol": "RUNEUSDT", "blockchain": "thorchain", "coingecko_id": "thorchain", "coingecko_name": "THORChain", "consensus": "proof of stake", "sector": "decentralized exchanges", "tps": 800, "type": "bep2", "usage": ["payments", "work", "defi"], "desc": "THORChain is an independent blockchain built using the Cosmos SDK that will serve as a cross-chain decentralized exchange (DEX). It uses an automated market maker (AMM) model that resembles the first iterations of Bancor (BNT) or Uniswap where THORChain's native token (RUNE) will be the base swap pair. This model allows traders to move between different asset pools using RUNE as a somewhat hidden intermediary. It also rewards liquidity providers (LPs), those that deposit or “stake” assets on either side of a liquidity pool, with a portion of trading fees."}, "shib": {"binance_symbol": "SHIBUSDT", "coingecko_id": "shiba-inu", "coingecko_name": "Shiba Inu", "blockchain": "ethereum", "consensus": "proof of stake", "sector": "currencies", "tps": "n/a", "type": "erc-20", "usage": "payments", "desc": "Could not do shib"}, "snx": {"binance_symbol": "SNXUSDT", "coingecko_id": "havven", "coingecko_name": "Synthetix Network Token", "blockchain": "ethereum", "consensus": "proof of stake", "sector": "derivatives", "tps": "n/a", "type": "erc-20", "usage": ["defi", "work"], "desc": "Synthetix is a token for minting synthetic assets on the Synthetix Network, built on Ethereum."}, "sol": {"binance_symbol": "SOLUSDT", "blockchain": "solana", "coingecko_id": "solana", "coingecko_name": "Solana", "consensus": ["proof of history", "proof of stake"], "sector": "smart contract platforms", "tps": 65000, "type": "native", "usage": ["dapps", "smart contracts", "defi", "speed", "scalability", "nft", "fees payment", "payments", "gaming"], "desc": "Solana is a public base-layer blockchain protocol that optimizes for scalability. Its goal is to provide a platform that enables developers to create decentralized applications (dApps) without needing to design around performance bottlenecks. Solana features a new timestamp system called Proof-of-History (PoH) that enables automatically ordered transactions. It also uses a Proof of Stake (PoS) consensus algorithm to help secure the network. Additional design goals include sub-second settlement times, low transaction costs, and support for all LLVM compatible smart contract languages."}, "spell": {"blockchain": "ethereum", "coingecko_id": "spell-token", "coingecko_name": "Spell Token", "consensus": "proof of stake", "sector": "lending", "tps": "n/a", "type": "erc-20", "usage": "defi", "desc": "Could not do spell"}, "steth": {"blockchain": "ethereum", "coingecko_id": "staked-ether", "coingecko_name": "Lido Staked Ether", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 20, "type": "erc-20", "usage": ["stacking", "defi"], "desc": "Could not do steth"}, "stx": {"binance_symbol": "STXUSDT", "blockchain": "stacks", "coingecko_id": "blockstack", "coingecko_name": "Stacks", "consensus": "proof of transfer", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "smart contracts", "dapps", "digital assets"], "desc": "Stacks (formerly Blockstack) provides software for internet ownership, which includes infrastructure and developer tools to power a computing network and ecosystem for decentralized applications (dApps). Its focus is to replace the reliance on centralized cloud service providers and apps that harvest and monetize user information. The Stacks network allows users to directly own digital assets like usernames, domain names, computer programs, etc. On the Stacks blockchain, computing is done on the edges (i.e., client devices), and applications on the platform store data individually and use the blockchain only when necessary."}, "sushi": {"binance_symbol": "SUSHIUSDT", "blockchain": "ethereum", "coingecko_id": "sushi", "coingecko_name": "Sushi", "consensus": "n/a", "sector": "decentralized exchanges", "tps": 20, "type": "erc-20", "usage": ["vote", "dividends", "defi"], "desc": "SushiSwap is a decentralized exchange built on Ethereum that utilizes an automated market making system rather than a traditional order-book. Instead of matching individual buy and sell orders, users can pool together two assets that are then traded against, with the price determined based on the ratio between the two. SushiSwap began as a fork of Uniswap; however, is growing into a more diversified, more grassroots alternative."}, "tel": {"coingecko_id": "telcoin", "coingecko_name": "Telcoin", "blockchain": "ethereum", "consensus": "n/a", "sector": "payment platforms", "tps": "n/a", "type": "erc-20", "usage": ["payments", "mobile"], "desc": "Telcoin is a mobile remittance network built on top of Ethereum. The project plans to compete with existing remittance providers by providing low-cost services directly through mobile carriers."}, "tfuel": {"binance_symbol": "TFUELUSDT", "blockchain": "theta network", "coingecko_id": "theta-fuel", "coingecko_name": "Theta Fuel", "consensus": "proof of stake", "sector": "content creation and distribution", "tps": 1000, "type": "native", "usage": ["payments", "nft", "smart contracts", "dapps"], "desc": "The Theta Network is a blockchain protocol for improving the process of creating, streaming, and consuming video content online. Theta Fuel Tokens are used in the network to incentivize users to act as peers who share redundant or excess computing and bandwidth resources with other peers. In June 2021, Theta Network added NFTs, e.g. trading cards of media celebrities, to the product portfolio. Prices are quoted in USD and TFUEL."}, "theta": {"binance_symbol": "THETAUSDT", "blockchain": "theta network", "coingecko_id": "theta-token", "coingecko_name": "Theta Network", "consensus": "proof of stake", "sector": "content creation and distribution", "tps": 1000, "type": "native", "usage": ["payments", "vote", "nft", "smart contracts", "dapps"], "desc": "The Theta Network is a blockchain protocol for improving the process of creating, streaming, and consuming video content online. Theta Tokens are used in the network to incentivize users to act as peers who share redundant or excess computing and bandwidth resources with other peers. In June 2021, Theta Network added NFTs, e.g. trading cards of media celebrities, to the product portfolio."}, "trx": {"binance_symbol": "TRXUSDT", "coingecko_id": "tron", "coingecko_name": "TRON", "blockchain": "tron", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "vote", "dapps"], "desc": "TRON is a multi-purpose smart contract platform that enables the creation and deployment of decentralized applications (dApps). It features a delegated Proof-of-Stake (DPoS) consensus mechanism, a system that offers an increase in performance while relinquishing true decentralization and censorship resistance. Tron is the brainchild of notorious crypto celebrity Justin Sun, who through Tron also acquired the peer-to-peer file-sharing network BitTorrent in 2018 and launched the BitTorrent Token (BTT) a few months later."}, "tusd": {"binance_symbol": "TUSDUSDT", "coingecko_id": "true-usd", "coingecko_name": "TrueUSD", "blockchain": "ethereum", "consensus": "n/a", "sector": "stablecoins", "tps": "n/a", "type": "erc-20", "usage": "payments", "desc": "TrueUSD is a fiat-collateralized stablecoin issued by the TrustToken platform that keeps USD funds in third party escrow accounts without direct access by TrustToken. TrueUSD is an ERC-20 token issued on the Ethereum and corresponds on a 1:1 basis with US Dollars sitting in bank accounts. TrueUSD is the only stablecoin offering real time audits."}, "uni": {"binance_symbol": "UNIUSDT", "coingecko_id": "uniswap", "coingecko_name": "Uniswap", "blockchain": "ethereum", "consensus": "n/a", "sector": "decentralized exchanges", "tps": "n/a", "type": "erc-20", "usage": ["vote", "defi"], "desc": "Uniswap is a decentralized exchange built on Ethereum that utilizes an automated market making system rather than a traditional order-book. Instead of matching individual buy and sell orders, users can pool together two assets that are then traded against, with the price determined based on the ratio between the two."}, "usdc": {"binance_symbol": "USDCUSDT", "blockchain": ["ethereum", "solana", "algorand", "stellar", "tron"], "coingecko_id": "usd-coin", "coingecko_name": "USD Coin", "consensus": "n/a", "sector": "stablecoins", "tps": 1000, "type": "fully collateralized", "usage": "payments", "desc": "USD Coin (USDC) is fiat-collateralized stablecoin that offers the advantages of transacting with blockchain-based assets while mitigating price risk. Each USDC is issued as an ERC-20 token on the Ethereum blockchain and is 100% collateralized by a corresponding USD held in accounts subject to regular public reporting of reserves."}, "usdt": {"coingecko_id": "tether", "coingecko_name": "Tether", "blockchain": ["ethereum", "omni", "tron"], "consensus": "n/a", "sector": "stablecoins", "tps": "n/a", "type": ["erc-20", "omni", "trc-20"], "usage": "payments", "desc": "Tether is fiat-collateralized stablecoin that offers individuals the advantages of transacting with blockchain-based assets while mitigating price risk. Tether is primarily issued on the Ethereum and Bitcoin blockchains and corresponds on a 1:1 basis with US Dollars sitting in bank accounts."}, "ust": {"coingecko_id": "terrausd", "coingecko_name": "TerraUSD", "sector": "stablecoins", "desc": "Could not do ust"}, "vet": {"binance_symbol": "VETUSDT", "coingecko_id": "vechain", "coingecko_name": "VeChain", "blockchain": "vechain", "consensus": "proof of authority", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "iot"], "desc": "VeChain is a smart contract platform focused on providing supply chain management solutions for enterprises and integrating with Internet of Things (IoT) devices to facilitate the process. Its goal is to leverage distributed ledger technology to streamline these operations and information flow for complicated supply chains. VeChain Token (VET) and VeChainThor Energy (VTHO) are the two tokens on the Vechain network. The former is used to relay value across VeChain's network, while the latter is utilized to power smart contract transactions as energy or \"gas.\" The VeChain platform claims to give authorized stakeholders with a total view of critical information related to a product and its business processes (i.e storage, transit, supply and authenticity) as well as increase market transparency."}, "waves": {"binance_symbol": "WAVESUSDT", "coingecko_id": "waves", "coingecko_name": "Waves", "blockchain": "waves", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": "n/a", "type": "native", "usage": ["payments", "dapps", "governance"], "desc": "Waves is a public blockchain network that enables users to create and access decentralized applications. It features on-chain governance, Formal Verification for smart contracts, and a variation of Proof-of-Stake (PoS) called Leased PoS to ensure network consensus."}, "wbtc": {"binance_symbol": "WBTCBTC", "blockchain": "ethereum", "coingecko_id": "wrapped-bitcoin", "coingecko_name": "Wrapped Bitcoin", "consensus": "proof of work", "sector": "smart contract platforms", "tps": 20, "type": "erc-20", "usage": ["smart contracts", "defi", "dapps"], "desc": "Wrapped Bitcoin is the first ERC20 token backed 1:1 with Bitcoin"}, "xdc": {"coingecko_id": "xdce-crowd-sale", "coingecko_name": "XDC Network", "sector": "currencies", "desc": "Could not do xdc"}, "xec": {"binance_symbol": "XECUSDT", "coingecko_id": "ecash", "coingecko_name": "eCash", "sector": "currencies", "usage": "payments", "desc": "Could not do xec"}, "xem": {"binance_symbol": "XEMUSDT", "blockchain": "nem", "coingecko_id": "nem", "coingecko_name": "NEM", "consensus": "proof of importance", "sector": "smart contract platforms", "tps": 4000, "type": "native", "usage": ["payments", "smart contracts", "regulatory control"], "desc": "NEM is a smart contracts platform focused on high performance and enterprise solutions."}, "xlm": {"binance_symbol": "XLMUSDT", "blockchain": "stellar", "coingecko_id": "stellar", "coingecko_name": "Stellar", "consensus": "stellar consensus protocol", "sector": "currencies", "tps": 1000, "type": "native", "usage": "payments", "desc": "Stellar is an open-source payments network that serves as a distributed intermediary blockchain for global financial systems and circulates a native asset, Stellar Lumens (XLM). The Stellar blockchain allows anyone to issue new assets in the network and exchange for other assets via built-in asset exchange features. Assets on Stellar are issued and redeemed by anchors, who are trusted entities that issue digital credits on the Stellar network in exchange for deposits of the asset with the trusted entity. Anchors enable real world assets to be exchanged on Stellar by leveraging a distributed exchange that maintains an order book for every asset pair. Stellar supports the issuance of any type of asset including stocks, currencies, cryptoassets and more."}, "xmr": {"binance_symbol": "XMRUSDT", "blockchain": "monero", "coingecko_id": "monero", "coingecko_name": "Monero", "consensus": "proof of work", "sector": "currencies", "tps": 1700, "type": "native", "usage": ["payments", "privacy"], "desc": "Aimed at privacy-preservation and fungibility, Monero is a Bytecoin code fork providing anonymous value transfer through ring signatures, stealth addresses, confidential transactions, and bulletproofs. Monero offers anonymity by default in contrast to the optional privacy preserving functionalities of its peers. In pursuit of decentralization Monero continually changes its proof-of-work algorithm in order to prevent ASICs from dominating and centralizing the mining process."}, "xrp": {"binance_symbol": "XRPUSDT", "coingecko_id": "ripple", "coingecko_name": "XRP", "blockchain": "xrp", "consensus": "ripple consensus algorithm", "sector": "currencies", "tps": 1000, "type": "native", "usage": ["payments", "speed"], "desc": "XRP is a cryptocurrency aiming to increase the speed and reduce the cost of transferring money between financial institutions. Underpinning Ripple's xRapid product, an on-demand liquidity solution, XRP is used as a bridge currency for financial institutions exchanging value between multiple fiat currencies. XRP is the native token of the XRP Ledger, an open-source cryptographic ledger powered by a peer-to-peer network of nodes."}, "xtz": {"binance_symbol": "XTZUSDT", "blockchain": "tezos", "coingecko_id": "tezos", "coingecko_name": "Tezos", "consensus": "proof of stake", "sector": "smart contract platforms", "tps": 40, "type": "native", "usage": ["vote", "dapps", "smart contracts"], "desc": "Tezos is a multi-purpose blockchain which aims to combine a self-amending protocol and on-chain governance to manage future changes and implementations to the network. It supports the creation of new tokens and smart contracts (thus decentralized applications or dApps). The on-chain governance system enables token holders to make decisions together and improve the network over time, as opposed to the less-inclusive off-chain governance models used by Bitcoin and Ethereum."}, "yfi": {"binance_symbol": "YFIUSDT", "coingecko_id": "yearn-finance", "coingecko_name": "yearn.finance", "blockchain": "ethereum", "consensus": "n/a", "sector": "asset management", "tps": "n/a", "type": "erc-20", "usage": ["vote", "defi", "lending", "insurance"], "desc": "yEarn.finance is a decentralized asset management platform that has multiple uses ranging from liquidity provision, lending, to insurance. The most prominent product in its ecosystem is Vaults which maximize users' yields by through various yield farming strategies proposed by the community."}, "zec": {"binance_symbol": "ZECUSDT", "coingecko_id": "zcash", "coingecko_name": "Zcash", "blockchain": "zcash", "consensus": "proof of work", "sector": "currencies", "tps": "n/a", "type": "native", "usage": ["payments", "privacy"], "desc": "Zcash is a privacy-preserving cryptocurrency providing anonymous value transfer using zero-knowledge cryptography. The protocol provides the option for transactions to be either shielded, in which case they will be completely anonymous, or transparent, in which case they will be visible on the Zcash blockchain. Zcash pays out a portion of its block rewards, called the \"Founder's Reward\", to fund protocol development. It currently allocates the Founder's Reward to the Electric Coin Company and the Zcash Foundation who develop and steward the Zcash protocol respectively."}, "zil": {"binance_symbol": "ZILUSDT", "blockchain": "zilliqa", "coingecko_id": "zilliqa", "coingecko_name": "Zilliqa", "consensus": ["proof of work", "pbft"], "sector": "smart contract platforms", "tps": 2500, "type": "erc-20", "usage": ["scalability", "smart contracts", "payments", "nft"], "desc": "Zilliqa is a smart contract platform featuring a sharded architecture that aims to address the scalability limitations seen in some other blockchains. Its sharded design allows concurrent chains to execute transactions in parallel, thereby increasing the overall capacity of the network. In addition to scalability, Zilliqa provides a smart contract layer to support smart contract creation by way of its native programming language, Scilla. The network reaches a consensus on transactions and contract executions through a hybrid Proof-of-Work-BFT mechanism. In the coming weeks, it will also introduce a staking system to, in its words, increase the distribution of node operators."}}